# Energy Analysis Zone Heating Set Point Property

Source: https://www.revitapidocs.com/2026/767f4a18-f3db-c148-38ca-2f9b7f7a65ba.htm

---

| Energy Analysis Zone Heating Set Point Property |
| --- |

The heating temperature set point in unit Kelvin (K).
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HeatingSetPoint { get; }
```

```
Public ReadOnly Property HeatingSetPoint As Double
	Get
```

```
public:
property double HeatingSetPoint {
	double get ();
}
```

```
member HeatingSetPoint : float with get
```

#### Property Value

Double See Also

#### Reference

EnergyAnalysisZone Class Autodesk.Revit.DB.Analysis Namespace